In [0]:
# Scrap File

In [0]:
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
··········
Mounted at /content/drive

In [0]:
file_path = '/content/drive/My Drive/Colab Notebooks/Data Structures and Alogorithms/Project 1 - Investigating Texts and Calls/Task0.py'
file_calls = '/content/drive/My Drive/Colab Notebooks/Data Structures and Alogorithms/Project 1 - Investigating Texts and Calls/calls.csv'
file_texts = '/content/drive/My Drive/Colab Notebooks/Data Structures and Alogorithms/Project 1 - Investigating Texts and Calls/texts.csv'

In [0]:
%pycat file_path

In [0]:
import csv
import pandas as pd
import numpy as np

In [0]:
with open(file_texts, 'r') as f:
    reader = csv.reader(f)
    texts = list(reader)

with open(file_calls, 'r') as f:
    reader = csv.reader(f)
    calls = list(reader)

In [0]:
print(texts[0])

['97424 22395', '90365 06212', '01-09-2016 06:03:22']

In [0]:
print(calls[-1])

['98447 62998', '(080)46304537', '30-09-2016 23:57:15', '2151']

In [0]:
def getPhoneNumbers(list_whole):
  list_phone_numbers = []
  for item in list_whole:
    arr_list = str(item).split(',')
    list_phone_numbers.append(arr_list[0])
    list_phone_numbers.append(arr_list[1])
  return list_phone_numbers

In [0]:
calls_phone_numbers = getPhoneNumbers(calls)
texts_phone_numbers = getPhoneNumbers(texts)

In [0]:
combined_list = calls_phone_numbers + texts_phone_numbers
combined_list = set(combined_list)

In [0]:
len(combined_list)

1039

In [0]:
len(calls_phone_numbers), len(texts_phone_numbers)

(10426, 18144)

In [0]:
print('There are {} different telephone numbers in the records'.format(len(combined_list)))

There are 1039 different telephone numbers in the records

In [0]:
calls[0]

['78130 00821', '98453 94494', '01-09-2016 06:01:12', '186']

In [0]:
df_calls = pd.DataFrame(calls, columns=['Calling_Number', 'Receiving_Number', 'Start_Time', 'Duration'])

In [0]:
df_calls.head()

  Calling_Number Receiving_Number           Start_Time Duration
0    78130 00821      98453 94494  01-09-2016 06:01:12      186
1    78298 91466    (022)28952819  01-09-2016 06:01:59     2093
2    97424 22395    (022)47410783  01-09-2016 06:03:51     1975
3    93427 40118    (080)33118033  01-09-2016 06:11:23     1156
4    90087 42537    (080)35121497  01-09-2016 06:17:26      573

In [0]:
df_temp = df_calls.head()

In [0]:
df_temp

  Calling_Number Receiving_Number           Start_Time Duration
0    78130 00821      98453 94494  01-09-2016 06:01:12      186
1    78298 91466    (022)28952819  01-09-2016 06:01:59     2093
2    97424 22395    (022)47410783  01-09-2016 06:03:51     1975
3    93427 40118    (080)33118033  01-09-2016 06:11:23     1156
4    90087 42537    (080)35121497  01-09-2016 06:17:26      573

In [0]:
df_t1 = df_temp.melt(id_vars=['Calling_Number'], value_vars=['Duration'], value_name='Duration')
df_t1.rename(columns = {'Calling_Number':'Phone_Number'}, inplace = True)
df_t1.Duration = df_t1.Duration.astype(int)
df_t1.head()

  Phone_Number  variable  Duration
0  78130 00821  Duration       186
1  78298 91466  Duration      2093
2  97424 22395  Duration      1975
3  93427 40118  Duration      1156
4  90087 42537  Duration       573

In [0]:
df_t1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
Phone_Number    5 non-null object
variable        5 non-null object
Duration        5 non-null int64
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [0]:
df_t2 = df_temp.melt(id_vars=['Receiving_Number'], value_vars=['Duration'], value_name='Duration')
df_t2.rename(columns = {'Receiving_Number':'Phone_Number'}, inplace = True)
df_t2.Duration = df_t2.Duration.astype(int)
df_t2.head()

    Phone_Number  variable  Duration
0    98453 94494  Duration       186
1  (022)28952819  Duration      2093
2  (022)47410783  Duration      1975
3  (080)33118033  Duration      1156
4  (080)35121497  Duration       573

In [0]:
df_t3 = pd.concat([df_t1, df_t2], axis=0, sort=False)
df_t3.reset_index(inplace=True, drop=True)
df_t3.head(10)

    Phone_Number  variable  Duration
0    78130 00821  Duration       186
1    78298 91466  Duration      2093
2    97424 22395  Duration      1975
3    93427 40118  Duration      1156
4    90087 42537  Duration       573
5    98453 94494  Duration       186
6  (022)28952819  Duration      2093
7  (022)47410783  Duration      1975
8  (080)33118033  Duration      1156
9  (080)35121497  Duration       573

In [0]:
df_t3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
Phone_Number    10 non-null object
variable        10 non-null object
Duration        10 non-null int64
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes

In [0]:
df_t4 = df_t3.groupby(['Phone_Number']).Duration.sum().reset_index()
df_t4.head(10)

    Phone_Number  Duration
0  (022)28952819      2093
1  (022)47410783      1975
2  (080)33118033      1156
3  (080)35121497       573
4    78130 00821       186
5    78298 91466      2093
6    90087 42537       573
7    93427 40118      1156
8    97424 22395      1975
9    98453 94494       186

In [0]:
df_t4.sort_values(by = ['Duration'], ascending=[False], inplace=True)

In [0]:
df_t4.head(10)

    Phone_Number  Duration
0  (022)28952819      2093
5    78298 91466      2093
1  (022)47410783      1975
8    97424 22395      1975
2  (080)33118033      1156
7    93427 40118      1156
3  (080)35121497       573
6    90087 42537       573
4    78130 00821       186
9    98453 94494       186

In [0]:
df_t3.groupby(['Phone_Number']).Duration.sum().reset_index().sort_values(by = ['Duration'], ascending=[False], inplace=True)

AttributeError: ignored

In [0]:
df_t4.Phone_Number[0]

'(022)28952819'

In [0]:
#Import the list to a dataframe
df_calls = pd.DataFrame(calls, columns=['Calling_Number', 'Receiving_Number', 'Start_Time', 'Duration'])

# Split it by making and receiving calls
df_CallingNumbers = df_calls.melt(id_vars=['Calling_Number'], value_vars=['Duration'], value_name='Duration')
df_CallingNumbers.rename(columns={'Calling_Number':'Phone_Number'}, inplace=True)
df_CallingNumbers.Duration = df_CallingNumbers.Duration.astype(int)

df_ReceivingNumbers = df_calls.melt(id_vars=['Receiving_Number'], value_vars=['Duration'], value_name='Duration')
df_ReceivingNumbers.rename(columns={'Receiving_Number':'Phone_Number'}, inplace=True)
df_ReceivingNumbers.Duration = df_ReceivingNumbers.Duration.astype(int)

# Combine the lists
df_CombinedNumbers = pd.concat([df_CallingNumbers, df_ReceivingNumbers], axis=0, sort=False)
df_CombinedNumbers.reset_index(inplace=True, drop=True)

# Group By and find the sum of all durations
df_GroupedNumbers = df_CombinedNumbers.groupby(['Phone_Number']).Duration.sum().reset_index()

# Sort and get the first one
df_GroupedNumbers.sort_values(by = ['Duration'], ascending=[False], inplace=True)
df_GroupedNumbers.reset_index(inplace=True, drop=True)

#Print
print('{}  spent the longest time, {} seconds, on the phone during September 2016.'.format(df_GroupedNumbers.Phone_Number[0], df_GroupedNumbers.Duration[0]))

(080)33251027  spent the longest time, 90456 seconds, on the phone during September 2016.

In [0]:
df_CombinedNumbers.head()

  Phone_Number  variable  Duration
0  78130 00821  Duration       186
1  78298 91466  Duration      2093
2  97424 22395  Duration      1975
3  93427 40118  Duration      1156
4  90087 42537  Duration       573

In [0]:
df_GroupedNumbers.head()

    Phone_Number  Duration
0  (080)33251027     90456
1    97380 60551     84209
2  (080)62164823     80264
3    99001 95783     78991
4  (080)45291968     75085

In [0]:
df_calls_from_blore = df_calls[df_calls.Calling_Number.str.startswith('(080)')].reset_index(drop=True)
df_calls_from_blore.head()

  Calling_Number Receiving_Number           Start_Time Duration
0  (080)45291968      90365 06212  01-09-2016 06:30:36        9
1  (080)62164823      74066 93594  01-09-2016 06:52:07      300
2  (080)67362492    (04344)316423  01-09-2016 07:24:45     2258
3  (080)69245029    (044)49481100  01-09-2016 07:34:19        9
4  (080)47459867      98440 65896  01-09-2016 08:08:59     2147

In [0]:
def getAreaCode(ph_no):
  areaCode = ''
  ph_no = str(ph_no)
  if(ph_no.startswith('140')):
    areaCode = '140'
  elif(ph_no.startswith('(')):
    idx_ending_parenthesis = ph_no.find(')')
    if(idx_ending_parenthesis>=0):
      areaCode = ph_no[1:idx_ending_parenthesis]
  elif(ph_no.find(' ')>=0):
    areaCode = ph_no[0:4]

  return areaCode

In [0]:
getAreaCode('140(04344)316423')

'140'

In [0]:
df_calls_from_blore['AreaCode'] = df_calls_from_blore.apply(lambda x: getAreaCode(x['Receiving_Number']), axis=1)

In [0]:
df_calls_from_blore.head()

  Calling_Number Receiving_Number           Start_Time Duration AreaCode
0  (080)45291968      90365 06212  01-09-2016 06:30:36        9     9036
1  (080)62164823      74066 93594  01-09-2016 06:52:07      300     7406
2  (080)67362492    (04344)316423  01-09-2016 07:24:45     2258    04344
3  (080)69245029    (044)49481100  01-09-2016 07:34:19        9      044
4  (080)47459867      98440 65896  01-09-2016 08:08:59     2147     9844

In [0]:
np.sort(df_calls_from_blore.AreaCode.unique())

array(['022', '040', '04344', '044', '04546', '0471', '080', '0821',
       '7406', '7795', '7813', '7829', '8151', '8152', '8301', '8431',
       '8714', '9008', '9019', '9035', '9036', '9241', '9242', '9341',
       '9342', '9343', '9400', '9448', '9449', '9526', '9656', '9738',
       '9740', '9741', '9742', '9844', '9845', '9900', '9961'],
      dtype=object)

In [0]:
for a in np.sort(df_calls_from_blore.AreaCode.unique()):
  print(a)

022
040
04344
044
04546
0471
080
0821
7406
7795
7813
7829
8151
8152
8301
8431
8714
9008
9019
9035
9036
9241
9242
9341
9342
9343
9400
9448
9449
9526
9656
9738
9740
9741
9742
9844
9845
9900
9961

In [0]:
# Function to get Area Code
def getAreaCode(ph_no):
  areaCode = ''
  ph_no = str(ph_no)
  if(ph_no.startswith('140')):
    areaCode = '140'
  elif(ph_no.startswith('(')):
    idx_ending_parenthesis = ph_no.find(')')
    if(idx_ending_parenthesis>=0):
      areaCode = ph_no[1:idx_ending_parenthesis]
  elif(ph_no.find(' ')>=0):
    areaCode = ph_no[0:4]

  return areaCode

#Import the list to a dataframe
df_calls = pd.DataFrame(calls, columns=['Calling_Number', 'Receiving_Number', 'Start_Time', 'Duration'])

# Filter on Originating calls from Bangalore
df_calls_from_blore = df_calls[df_calls.Calling_Number.str.startswith('(080)')].reset_index(drop=True)

# Apply a lamda function to get Area codes into a separate column
df_calls_from_blore['AreaCode'] = df_calls_from_blore.apply(lambda x: getAreaCode(x['Receiving_Number']), axis=1)

# Print the Area Codes
print('The numbers called by people in Bangalore have codes:')
for ac in np.sort(df_calls_from_blore.AreaCode.unique()):
  print(ac)

The numbers called by people in Bangalore have codes:
022
040
04344
044
04546
0471
080
0821
7406
7795
7813
7829
8151
8152
8301
8431
8714
9008
9019
9035
9036
9241
9242
9341
9342
9343
9400
9448
9449
9526
9656
9738
9740
9741
9742
9844
9845
9900
9961

In [0]:
df_calls[df_calls.Calling_Number.str.startswith('94')].head()

   Calling_Number Receiving_Number           Start_Time Duration
68    94497 44333      97385 70012  01-09-2016 12:15:43       46
71    94005 20878    (080)49328664  01-09-2016 12:20:15      151
82    94487 29969      97419 41164  01-09-2016 13:33:45      501
94    94005 20878    (080)49328664  01-09-2016 14:23:45      150
95    94486 40312    (044)48154960  01-09-2016 14:29:23      494

In [0]:
df_calls_from_blore.head()

  Calling_Number Receiving_Number           Start_Time Duration AreaCode
0  (080)45291968      90365 06212  01-09-2016 06:30:36        9     9036
1  (080)62164823      74066 93594  01-09-2016 06:52:07      300     7406
2  (080)67362492    (04344)316423  01-09-2016 07:24:45     2258    04344
3  (080)69245029    (044)49481100  01-09-2016 07:34:19        9      044
4  (080)47459867      98440 65896  01-09-2016 08:08:59     2147     9844

In [0]:
round((df_calls_from_blore[df_calls_from_blore.AreaCode=='080'].shape[0]/df_calls_from_blore.shape[0])*100, 2)

24.81

In [0]:
pct_blore_to_blore = round((df_calls_from_blore[df_calls_from_blore.AreaCode=='080'].shape[0]/df_calls_from_blore.shape[0])*100, 2)
print('{} percent of calls from fixed lines in Bangalore are calls to other fixed lines in Bangalore.'.format(pct_blore_to_blore))

24.81 percent of calls from fixed lines in Bangalore are calls to other fixed lines in Bangalore.

In [0]:
df_calls_from_blore[df_calls_from_blore.AreaCode=='9180']

Empty DataFrame
Columns: [Calling_Number, Receiving_Number, Start_Time, Duration, AreaCode]
Index: []